# VS Code Extensions - Ultrathink Environment
# Automatically generated and managed via chezmoi
# Install with: cat extensions.txt | grep -v '^#' | xargs -L 1 code --install-extension

# === AI/Productivity ===
anthropic.claude-code
github.copilot
github.copilot-chat
coderabbit.coderabbit-vscode

# === Development Tools ===
formulahendry.code-runner
fill-labs.dependi

# === Remote Development Suite ===
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode-remote.remote-wsl
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-containers
ms-vscode.remote-explorer
ms-vscode.remote-server

# === Container/Kubernetes ===
ms-azuretools.vscode-docker
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools

# === Testing/Debugging ===
ms-playwright.playwright

# === Language Support ===
rust-lang.rust-analyzer
redhat.vscode-yaml

# === Utilities ===
yzhang.markdown-all-in-one
aaravb.chrome-extension-developer-tools

# === Editor Enhancement ===
vscodevim.vim                       # Vim emulation (full Vim mode)

# === Recommended (Optional) ===
# eamodio.gitlens                  # Advanced Git features
# ms-python.python                 # Python support
# ms-vscode.cpptools               # C/C++ support
# golang.go                        # Go support
